RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_sinc.h
/*
 * Copyright 2022-2024 NXP
 *
 * All rights reserved.
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef FSL_SINC_H_
#define FSL_SINC_H_

#include "fsl_common.h"

/*!
 * @addtogroup sinc
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*! @{ */
/*! @brief lower_component_name driver version 2.1.4. */
#define FSL_SINC_DRIVER_VERSION (MAKE_VERSION(2, 1, 4))
/*! @} */
#if defined(FSL_FEATURE_SINC_CHANNEL_COUNT)
#define SINC_CHANNEL_COUNT (FSL_FEATURE_SINC_CHANNEL_COUNT)
#else
#error "The definition of FSL_FEATURE_SINC_CHANNEL_COUNT is missing!"
#endif
#define SINC_NORMAL_INT_REG_ID     (0ULL)
#define SINC_NORMAL_INT_NAME_COCIE (0ULL)
#define SINC_NORMAL_INT_NAME_CHFIE (1ULL)
#define SINC_NORMAL_INT_NAME_ZCDIE (2ULL)

#define SINC_ERROR_INT_REG_ID      (1ULL)
#define SINC_ERROR_INT_NAME_SCDIE  (0ULL)
#define SINC_ERROR_INT_NAME_WLMTIE (1ULL)
#define SINC_ERROR_INT_NAME_LLMTIE (2ULL)
#define SINC_ERROR_INT_NAME_HLMTIE (3ULL)

#define SINC_FIFO_CAD_INT_REG_ID (2ULL)
#define SINC_FIFO_CAD_INT_FUNFIE (0ULL)
#define SINC_FIFO_CAD_INT_FOVFIE (1ULL)
#define SINC_FIFO_CAD_INT_CADIE  (2ULL)
#define SINC_FIFO_CAD_INT_SATIE  (3ULL)

#define SINC_ENCODE_INTERRUPT(regId, name, channelId)                                           \
    ((((1ULL << (uint64_t)(channelId))) << ((uint64_t)(name) * (uint64_t)(SINC_CHANNEL_COUNT))) \
     << (uint64_t)(regId)*20ULL)

#define SINC_DECODE_INTERRUPT(interruptMask)                               \
    normalIntMask  = ((uint32_t)(interruptMask) & (0xFFFFFUL));            \
    errorIntMask   = ((uint32_t)((interruptMask) >> 20ULL) & (0xFFFFFUL)); \
    fifoCadIntMask = ((uint32_t)((interruptMask) >> 40ULL) & (0xFFFFFUL))

#define SINC_FIND_INT_FIELD_VALUE(mask, name)                                     \
    ((((uint32_t)(mask) >> ((uint32_t)(name) * ((uint32_t)SINC_CHANNEL_COUNT))) & \
      ((1UL << ((uint32_t)SINC_CHANNEL_COUNT)) - 1UL))                            \
     << (8UL * (uint32_t)(name)))

#define SINC_FIND_STATUS_FIELD_VALUE(statusValue, name)                \
    (((uint64_t)(statusValue) & (0xFFUL << ((uint64_t)(name)*8UL))) >> \
     ((uint64_t)(name) * (8UL - ((uint64_t)SINC_CHANNEL_COUNT))))
/*!
 * @brief The enumeration of SINC module's interrupts.
 * @anchor sinc_interrupt_enable_t
 */
enum _sinc_interrupt_enable
{
    /* Normal interrupts enable. */
    /* Enable the conversion complete interrupt for channel 0. */
    kSINC_CH0ConvCompleteIntEnable = SINC_ENCODE_INTERRUPT(SINC_NORMAL_INT_REG_ID, SINC_NORMAL_INT_NAME_COCIE, 0ULL),
    /* Enable the conversion complete interrupt for channel 1. */
    kSINC_CH1ConvCompleteIntEnable = SINC_ENCODE_INTERRUPT(SINC_NORMAL_INT_REG_ID, SINC_NORMAL_INT_NAME_COCIE, 1ULL),
    /* Enable the conversion complete interrupt for channel 2. */
    kSINC_CH2ConvCompleteIntEnable = SINC_ENCODE_INTERRUPT(SINC_NORMAL_INT_REG_ID, SINC_NORMAL_INT_NAME_COCIE, 2ULL),
    /* Enable the conversion complete interrupt for channel 3. */
    kSINC_CH3ConvCompleteIntEnable = SINC_ENCODE_INTERRUPT(SINC_NORMAL_INT_REG_ID, SINC_NORMAL_INT_NAME_COCIE, 3ULL),
#if (SINC_CHANNEL_COUNT >= 5UL)
    /* Enable the conversion complete interrupt for channel 4. */
    kSINC_CH4ConvCompleteIntEnable = SINC_ENCODE_INTERRUPT(SINC_NORMAL_INT_REG_ID, SINC_NORMAL_INT_NAME_COCIE, 4ULL),
#endif

    /* Enable the data output ready interrupt for channel 0. */
    kSINC_CH0DataReadyIntEnable = SINC_ENCODE_INTERRUPT(SINC_NORMAL_INT_REG_ID, SINC_NORMAL_INT_NAME_CHFIE, 0ULL),
    /* Enable the data output ready interrupt for channel 1. */
    kSINC_CH1DataReadyIntEnable = SINC_ENCODE_INTERRUPT(SINC_NORMAL_INT_REG_ID, SINC_NORMAL_INT_NAME_CHFIE, 1ULL),
    /* Enable the data output ready interrupt for channel 2. */
    kSINC_CH2DataReadyIntEnable = SINC_ENCODE_INTERRUPT(SINC_NORMAL_INT_REG_ID, SINC_NORMAL_INT_NAME_CHFIE, 2ULL),
    /* Enable the data output ready interrupt for channel 3. */
    kSINC_CH3DataReadyIntEnable = SINC_ENCODE_INTERRUPT(SINC_NORMAL_INT_REG_ID, SINC_NORMAL_INT_NAME_CHFIE, 3ULL),
#if (SINC_CHANNEL_COUNT >= 5UL)
    /* Enable the data output ready interrupt for channel 4. */
    kSINC_CH4DataReadyIntEnable = SINC_ENCODE_INTERRUPT(SINC_NORMAL_INT_REG_ID, SINC_NORMAL_INT_NAME_CHFIE, 4ULL),
#endif

    /* Enable the zero cross detected interrupt for channel 0. */
    kSINC_CH0ZeroCrossDetectedIntEnable =
        SINC_ENCODE_INTERRUPT(SINC_NORMAL_INT_REG_ID, SINC_NORMAL_INT_NAME_ZCDIE, 0ULL),
    /* Enable the zero cross detected interrupt for channel 1. */
    kSINC_CH1ZeroCrossDetectedIntEnable =
        SINC_ENCODE_INTERRUPT(SINC_NORMAL_INT_REG_ID, SINC_NORMAL_INT_NAME_ZCDIE, 1ULL),
    /* Enable the zero cross detected interrupt for channel 2. */
    kSINC_CH2ZeroCrossDetectedIntEnable =
        SINC_ENCODE_INTERRUPT(SINC_NORMAL_INT_REG_ID, SINC_NORMAL_INT_NAME_ZCDIE, 2ULL),
    /* Enable the zero cross detected interrupt for channel 3. */
    kSINC_CH3ZeroCrossDetectedIntEnable =
        SINC_ENCODE_INTERRUPT(SINC_NORMAL_INT_REG_ID, SINC_NORMAL_INT_NAME_ZCDIE, 3ULL),
#if (SINC_CHANNEL_COUNT >= 5UL)
    /* Enable the zero cross detected interrupt for channel 4. */
    kSINC_CH4ZeroCrossDetectedIntEnable =
        SINC_ENCODE_INTERRUPT(SINC_NORMAL_INT_REG_ID, SINC_NORMAL_INT_NAME_ZCDIE, 4ULL),
#endif

    /* Error interrupts enable. */
    /* Enable the short circuit detected interrupt for channel 0. */
    kSINC_CH0SCDIntEnable = SINC_ENCODE_INTERRUPT(SINC_ERROR_INT_REG_ID, SINC_ERROR_INT_NAME_SCDIE, 0ULL),
    /* Enable the short circuit detected interrupt for channel 1. */
    kSINC_CH1SCDIntEnable = SINC_ENCODE_INTERRUPT(SINC_ERROR_INT_REG_ID, SINC_ERROR_INT_NAME_SCDIE, 1ULL),
    /* Enable the short circuit detected interrupt for channel 2. */
    kSINC_CH2SCDIntEnable = SINC_ENCODE_INTERRUPT(SINC_ERROR_INT_REG_ID, SINC_ERROR_INT_NAME_SCDIE, 2ULL),
    /* Enable the short circuit detected interrupt for channel 3. */
    kSINC_CH3SCDIntEnable = SINC_ENCODE_INTERRUPT(SINC_ERROR_INT_REG_ID, SINC_ERROR_INT_NAME_SCDIE, 3ULL),
#if (SINC_CHANNEL_COUNT >= 5UL)
    /* Enable the short circuit detected interrupt for channel 4. */
    kSINC_CH4SCDIntEnable = SINC_ENCODE_INTERRUPT(SINC_ERROR_INT_REG_ID, SINC_ERROR_INT_NAME_SCDIE, 4ULL),
#endif

    /* Enable the window limit interrupt for channel 0. */
    kSINC_CH0WindowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_ERROR_INT_REG_ID, SINC_ERROR_INT_NAME_WLMTIE, 0ULL),
    /* Enable the window limit interrupt for channel 1. */
    kSINC_CH1WindowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_ERROR_INT_REG_ID, SINC_ERROR_INT_NAME_WLMTIE, 1ULL),
    /* Enable the window limit interrupt for channel 2. */
    kSINC_CH2WindowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_ERROR_INT_REG_ID, SINC_ERROR_INT_NAME_WLMTIE, 2ULL),
    /* Enable the window limit interrupt for channel 3. */
    kSINC_CH3WindowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_ERROR_INT_REG_ID, SINC_ERROR_INT_NAME_WLMTIE, 3ULL),
#if (SINC_CHANNEL_COUNT >= 5UL)
    /* Enable the window limit interrupt for channel 4. */
    kSINC_CH4WindowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_ERROR_INT_REG_ID, SINC_ERROR_INT_NAME_WLMTIE, 4ULL),
#endif

    /* Enable the low limit interrupt for channel 0. */
    kSINC_CH0LowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_ERROR_INT_REG_ID, SINC_ERROR_INT_NAME_LLMTIE, 0ULL),
    /* Enable the low limit interrupt for channel 1. */
    kSINC_CH1LowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_ERROR_INT_REG_ID, SINC_ERROR_INT_NAME_LLMTIE, 1ULL),
    /* Enable the low limit interrupt for channel 2. */
    kSINC_CH2LowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_ERROR_INT_REG_ID, SINC_ERROR_INT_NAME_LLMTIE, 2ULL),
    /* Enable the low limit interrupt for channel 3. */
    kSINC_CH3LowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_ERROR_INT_REG_ID, SINC_ERROR_INT_NAME_LLMTIE, 3ULL),
#if (SINC_CHANNEL_COUNT >= 5UL)
    /* Enable the low limit interrupt for channel 4. */
    kSINC_CH4LowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_ERROR_INT_REG_ID, SINC_ERROR_INT_NAME_LLMTIE, 4ULL),
#endif

