RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_sinc.h
    sinc_primary_filter_shift_direction_t pfShiftDirection; /*!< Select shift direction, right or left. */
    uint8_t u8pfShiftBitsNum; /*!< Specify the number of bits to shift the data, ranges from 0 to 15. */

    sinc_primary_filter_bias_sign_t pfBiasSign; /*!< Select bias sign, please refer
                                                    to @ref sinc_primary_filter_bias_sign_t. */
    uint32_t u32pfBiasValue;                    /*!< Range from 0 to 0x7FFFFFUL. */
} sinc_channel_conv_option_t;

/*!
 * @brief The structure of channel protection options, including limit check settings, short-circuit settings,
 * clock-absence settings, and zero-crossing settings.
 */
typedef struct _sinc_channel_protection_option
{
    sinc_limit_detector_mode_t limitDetectorMode; /*!< Specify limit detector mode, please
                                                      refer to @ref sinc_limit_detector_mode_t. */
    bool bEnableLmtBreakSignal;                   /*!< Enable/disable limit break signal,
                                                      the details of break signal is depended on detector mode. */
    uint32_t u32LowLimitThreshold;          /*!< Specify the low-limit threshold value, range from 0 to 0xFFFFFFUL. */
    uint32_t u32HighLimitThreshold;         /*!< Specify the high-limit threshold value, range from 0 to 0xFFFFFFUL. */

    sinc_scd_operate_mode_t scdOperateMode; /*!< Enable/disable scd, and set SCD operate timming.  */
    uint8_t u8ScdLimitThreshold;            /*!< Range from 2 to 255, 0 and 1 are prohibited. */
    sinc_scd_option_t scdOption;            /*!< Specify SCD options, please refer to @ref sinc_scd_option_t. */
    bool bEnableScdBreakSignal;             /*!< Enable/disable SCD break signal.  */

    sinc_cad_threshold_t cadLimitThreshold; /*!< Specify the threshold value for the CAD counter. */
    bool bEnableCadBreakSignal;             /*!< Enable/disable CAD break signal. */

    sinc_zero_cross_operate_mode_t zcdOperateMode; /*!< Specify zero cross detector operate mode. */
} sinc_channel_protection_option_t;

/*!
 * @brief The structure of channel configurations, including channel input option, channel conversion options, channel
 * protection options, and so on.
 */
typedef struct _sinc_channel_config
{
    bool bEnableChannel;                      /*!< Enable/disable channel. */
    bool bEnableFifo;                         /*!< Enable/disable channel's FIFO. */
    uint8_t u8FifoWaterMark;                  /*!< Specify the fifo watermark, range from 0 to 15. */
    bool bEnablePrimaryDma;                   /*!< Used to enable/disable primary DMA. */
#if (defined(FSL_FEATURE_SINC_CACFR_HAS_ADMASEL) && FSL_FEATURE_SINC_CACFR_HAS_ADMASEL)
    sinc_alternate_dma_source_t altDmaSource; /*!< Set channel's alternate DMA source, please refer
                                                  to @ref sinc_alternate_dma_source_t. */
#endif /* (defined(FSL_FEATURE_SINC_CACFR_HAS_ADMASEL) && FSL_FEATURE_SINC_CACFR_HAS_ADMASEL) */
    sinc_result_data_format_t dataFormat;       /*!< Set channel's result data format, please refer
                                                    to @ref sinc_result_data_format_t. */

    sinc_channel_input_option_t *chInputOption; /*!< The pointer to @ref sinc_channel_input_option_t that contains
                                                   channel input options. */
    sinc_channel_conv_option_t *chConvOption;   /*!< The pointer to @ref sinc_channel_conv_option_t that contains
                                                    channel conversion options. */
    sinc_channel_protection_option_t *chProtectionOption; /*!< The pointer to @ref sinc_channel_protection_option_t
                                                  that contains channel protection options. */
} sinc_channel_config_t;

/*!
 * @brief The structure of sinc configurations, including clock settings anc channels' settings.
 */
typedef struct _sinc_config
{
    sinc_clock_prescale_t clockPreDivider; /*!< Specify modulator clock pre divider, please
                                               refer to @ref sinc_clock_prescale_t. */
    uint32_t modClkDivider;    /*!<  Range from 2 to 256, 0 and 1 are prohibited, to obtain a 50% duty cycle in
                                   the MCLK output, write an even value to*/
    bool disableModClk0Output; /*!< Disable/enable modulator clock0 output. */
    bool disableModClk1Output; /*!< Disable/enable modulator clock1 output. */
    bool disableModClk2Output; /*!< Disable/enable modulator clock2 output. */

    sinc_channel_config_t *channelsConfigArray[SINC_CHANNEL_COUNT]; /*!< The array that contains 4 elements, and the
                                                   type of each element is \b sinc_channel_config_t *,
                                                   channelsConfigArray[0] corresponding to channel0,
                                                   channelsConfigArray[1] corresponding to channel1,
                                                   channelsConfigArray[2] corresponding to channel2,
                                                   channelsConfigArray[3] corresponding to channel3, if some channels
                                                   are not used, the corresponding elements should be set as NULL. */

    bool disableDozeMode; /*!< Disable/enable SINC module when the chip enters Doze or stop mode.  */
    bool enableMaster;    /*!< Enable/disable all function blocks of SINC module. */
} sinc_config_t;

/*******************************************************************************
 * API
 ******************************************************************************/

/*!
 * @name SINC Generic Functional Control APIs
 * @{
 */

/*!
 * @brief Initialize selected SINC instance, including clock options and channel options.
 *
 * @param base SINC peripheral base address.
 * @param config The pointer to @ref sinc_config_t structure.
 */
void SINC_Init(SINC_Type *base, const sinc_config_t *config);

/*!
 * @brief De-initialize selected SINC instance.
 *
 * @param base SINC peripheral base address.
 */
void SINC_Deinit(SINC_Type *base);

/*!
 * @brief Get default configuration.
 *
 * @code {.c}
 *     config->clockPreDivider = kSINC_ClkPrescale1;
 *     config->modClkDivider   = 2UL;
 *     config->disableModClk0Output = false;
 *     config->disableModClk1Output = false;
 *     config->disableModClk2Output = false;
 *
 *     config->channelsConfigArray[4] = {NULL, NULL, NULL, NULL};
 *
 *     config->disableDozeMode      = false;
 *     config->enableMaster         = false;
 * @endcode
 *
 *
 * @param config The pointer to @ref sinc_config_t structure, must not be NULL.
 */
void SINC_GetDefaultConfig(sinc_config_t *config);

/*! @} */

/*!
 * @name SINC Generic Low Level Control APIs
 * @{
 */

/*!
 * @brief Enable/disable all function blocks enabled in their respective registers.
 *
 * @param base SINC peripheral base address.
 * @param enable Used to enable/disable all function blocks:
 *          - \b true Enable all function blocks, please note that clock must be configured previously;
 *          - \b false Disable all function blocks.
 */
static inline void SINC_EnableMaster(SINC_Type *base, bool enable)
{
    if (enable)
    {
        base->MCR |= SINC_MCR_MEN_MASK;
    }
    else
    {
        base->MCR &= ~SINC_MCR_MEN_MASK;
    }
}

/*!
 * @brief Reset all function blocks(except for the clock blocks), interrupt statuses.
 *
 * @param base SINC peripheral base address.
 */
static inline void SINC_DoSoftwareReset(SINC_Type *base)
{
    base->MCR |= SINC_MCR_RST_MASK;
    base->MCR &= ~SINC_MCR_RST_MASK;
}

/*!
 * @brief Disable/enable SINC module when the chip enters Doze or Stop mode.
 *
 * @param base SINC peripheral base address.
 * @param disable Used to control if module functional when the chip enters Doze and Stop mode:
 *          - \b true Disable SINC when the chip enters Doze or Stop mode;
 *          - \b false Enable SINC when the chip enters Doze or stop mode.
 */
static inline void SINC_DisableDozeMode(SINC_Type *base, bool disable)
{
    if (disable)
    {
        base->MCR |= SINC_MCR_DOZEN_MASK;
    }
    else
    {
        base->MCR &= ~SINC_MCR_DOZEN_MASK;
    }
}

/*! @} */

/*!
 * @name Clock Control APIs
 * @{
 */

/*!
 * @brief Check whether selected modulator clocks are ready.
 *
 * @note The result of this APIs means all selected modulator clocks are (not) ready.
 *
 * @param base SINC peripheral base address.
 * @param modClkMasks The mask of modulator clocks, please refer to @ref _sinc_modulator_clock.
 *
 * @retval true The input mask of modulator clocks are ready.
 * @retval false The input mask of modulator clocks are not ready.
 */
static inline bool SINC_CheckModulatorClockReady(SINC_Type *base, uint32_t modClkMasks)
{
    return ((base->SR & (modClkMasks << SINC_SR_MCLKRDY0_SHIFT)) != 0UL);
}

/*!
 * @brief Disable/enable modulator clocks' output.
 *
 * @note By default, modulator clock's output is enabled.
 *
 * @param base SINC peripheral base address.
 * @param modClkMasks The mask of modulator clocks, please refer to @ref _sinc_modulator_clock.
 * @param disable Used to enable/disable clock output:
 *          - \b true Disable modulator clocks' output;
 *          - \b false Enable modulator clocks' output.
 */
static inline void SINC_DisableModulatorClockOutput(SINC_Type *base, uint32_t modClkMasks, bool disable)
{
    if (disable)
    {
        base->MCR |= (modClkMasks << SINC_MCR_MCLK0DIS_SHIFT);
    }
    else
    {
        base->MCR &= ~(modClkMasks << SINC_MCR_MCLK0DIS_SHIFT);
    }
}

/*!
 * @brief Set the clock divider ratio for the modulator clock.
 *
 * @param base SINC peripheral base address.
 * @param clkPrescale Clock prescale value, please refer to @ref sinc_clock_prescale_t.
 */
static inline void SINC_SetClkPrescale(SINC_Type *base, sinc_clock_prescale_t clkPrescale)
{
    base->MCR = (((base->MCR) & (~SINC_MCR_PRESCALE_MASK)) | SINC_MCR_PRESCALE(clkPrescale));
}

/*!
 * @brief Set modulator clock divider value.
 *
 * @note IMCLK0 = PRE_CLK / modClkDivider, the minimum clock divider ration is 2.
 *
 * @param base SINC peripheral base address.
 * @param modClkDivider Range from 2 to 256, 0 and 1 are prohibited, to obtain a 50% duty cycle in the MCLK output,
 *                      write an even value to \b modClkDivider .
 */
static inline void SINC_SetModulatorClockDivider(SINC_Type *base, uint32_t modClkDivider)
{
    assert(modClkDivider != 0UL);
    assert(modClkDivider != 1UL);

    base->MCR = (((base->MCR) & (~SINC_MCR_MCLKDIV_MASK)) | SINC_MCR_MCLKDIV((modClkDivider - 1UL)));
}

/* !} */

/*!
 * @name Channel Functional Control APIs
 * @{
 */

/*!
 * @brief Set channel configurations, including input options, conversion options and protection options.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param chConfig Pointer to @ref sinc_channel_config_t structure, must not be NULL.
 */
void SINC_SetChannelConfig(SINC_Type *base, sinc_channel_id_t chId, sinc_channel_config_t *chConfig);

/*!
 * @brief Set channel input options, including input bit format, input bit source, input bit delay, input clock source,
 * input clock edge.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param chInputOption Pointer to @ref sinc_channel_input_option_t structure, must not be NULL.
 */
void SINC_SetChannelInputOption(SINC_Type *base, sinc_channel_id_t chId, sinc_channel_input_option_t *chInputOption);

/*!
 * @brief Set channel conversion options, including conversion mode, trigger source, and primary filter settings.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param chConvOption Pointer to @ref sinc_channel_conv_option_t structure, must not be NULL.
 */
void SINC_SetChannelConversionOption(SINC_Type *base, sinc_channel_id_t chId, sinc_channel_conv_option_t *chConvOption);

/*!
 * @brief Set channel protection options, including limit check, short-circuit detector, clock-absence detector, and
 * zero-crossing detector.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param chProtection Pointer to @ref sinc_channel_protection_option_t, must not be NULL.
 */
void SINC_SetChannelProtectionOption(SINC_Type *base,
                                     sinc_channel_id_t chId,
                                     sinc_channel_protection_option_t *chProtection);

/*! @} */

/*!
 * @name Channel Result/FIFO Low Level Control APIs
 * @{
 */

/*!
 * @brief Read selected channel's result data.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 *
 * @return Result data of the selected channel, 24 bits width.
 */
static inline uint32_t SINC_ReadChannelResultData(SINC_Type *base, sinc_channel_id_t chId)
{
    return ((base->CHANNEL[(uint8_t)chId].CRDATA & SINC_CRDATA_RDATA_MASK) >> SINC_CRDATA_RDATA_SHIFT);
}

/*!
 * @brief Enable/disable FIFO transfers for the primary filter.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param enable Used to enable/disable channl FIFO:
 *          - \b true Enable channel FIFO.
 *          - \b false Disable channle FIFO.
 */
static inline void SINC_EnableChannelFIFO(SINC_Type *base, sinc_channel_id_t chId, bool enable)
{
    if (enable)
    {
        base->CHANNEL[(uint8_t)chId].CCR |= SINC_CCR_FIFOEN_MASK;
    }
    else
    {
        base->CHANNEL[(uint8_t)chId].CCR &= ~SINC_CCR_FIFOEN_MASK;
    }
}

/*!
 * @brief Set the FIFO watermark.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param fifoWaterMark Specify the fifo watermark, range from 0 to 15.
 */
static inline void SINC_SetChannelFifoWatermark(SINC_Type *base, sinc_channel_id_t chId, uint8_t fifoWaterMark)
{
    base->CHANNEL[(uint8_t)chId].CCFR =
        ((base->CHANNEL[(uint8_t)chId].CCFR) & (~SINC_CCFR_FIFOWMK_MASK)) | (SINC_CCFR_FIFOWMK(fifoWaterMark));
}

/*!
 * @brief Enable/disable selected channel.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param enable Used to enable/disable selected channel:
 *          - \b true Enable selected channel;
 *          - \b false Disable selected channel.
 */
static inline void SINC_EnableChannel(SINC_Type *base, sinc_channel_id_t chId, bool enable)
{
    if (enable)
    {
        base->CHANNEL[(uint8_t)chId].CCR |= SINC_CCR_CHEN_MASK;
    }
    else
    {
        base->CHANNEL[(uint8_t)chId].CCR &= ~SINC_CCR_CHEN_MASK;
    }
}

/*!
 * @brief Enable/disable selected channel's primary DMA transfers when the channel's FIFO exceeds its watermark.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param enable Used to enable/disable primary DMA :
 *          - \b true Enable primary DMA;
 *          - \b false Disable primary DMA.
 */
static inline void SINC_EnableChannelPrimaryDma(SINC_Type *base, sinc_channel_id_t chId, bool enable)
{
    if (enable)
    {
        base->CHANNEL[(uint8_t)chId].CCR |= SINC_CCR_DMAEN_MASK;
    }
    else
    {
        base->CHANNEL[(uint8_t)chId].CCR &= ~SINC_CCR_DMAEN_MASK;
    }
}

